import fs from 'node:fs';

if (!global.segment) {
  global.segment = (await import("oicq")).segment;
}

let ret = [];

logger.info(logger.yellow("- 正在载入 Yog-Sothoth"));

const files = fs
  .readdirSync('./plugins/Yog-Sothoth/apps')
  .filter((file) => file.endsWith('.js'));

files.forEach((file) => {
  ret.push(import(`./apps/${file}`))
})

ret = await Promise.allSettled(ret);

let apps = {};
for (let i in files) {
  let name = files[i].replace('.js', '');

  if (ret[i].status !== 'fulfilled') {
    logger.error(`载入插件错误：${logger.red(name)}`);
    logger.error(ret[i].reason);
    continue;
  }
  apps[name] = ret[i].value[Object.keys(ret[i].value)[0]];
}

logger.info(logger.green("- 载入成功"));
logger.info(logger.red(`- 你继承一座荒废已久的别墅并欠下黑暗债务。你将招募死神、龙族、斩灵师、人造人等员工开展旅社经营。奇怪的客人将带着神秘事件到访。你会通过挖矿，冒险，炼金，经营餐厅等不同策略积攒资产，不断调整策略，带领旅社走向不同结局`));
logger.info(logger.green(`                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   
                                                                              ||                                                                      
                                             |||     ||                       |||                   |||                          ||                   
                      |   |||                ||||    |||                      ||                    ||||                         |||                  
                     |||  |||                 |||    |||                      ||||||                 |||                          ||      |||         
                ||   |||  ||||||              ||     || |||                |||||||||                 ||      ||||            |||  ||      ||||        
                 ||| |||  ||| |||             ||    ||||||||              |||||||                    ||      |||||            || |||||  ||||          
                  |||||   ||  |||             ||    ||||||||                  ||    ||               ||     ||||             |||||||| ||||            
                   |||    ||    |             ||||||||  |||            |     |||||||||||             ||   ||||             |||||  ||   ||             
                  ||||    ||  ||||         ||||||||||| |||            |||||||||||||  ||||            |||||||||                ||||||   ||             
                 |||||||||||||||||        ||||||| || ||||             ||||||||| ||  |||||        ||||||||| |||                ||||||   ||  ||||||     
                ||||||||||||||               |||      |||             ||   ||| |||| ||           ||||||    ||| ||||           ||||||   ||||||||||     
               ||  |||   |||||               |||||   ||||||          |||  ||||||||                   ||||  ||||||||           ||||||   ||||||         
                  ||||   ||||               ||||||| ||| ||||||       |||  |||||||||                  ||||||||||               ||  ||   || |||         
                 |||||   ||||              ||||| | |||    |||||||     |   |  || ||||                |||||||||                 ||  |||| ||  ||         
                 || ||  |||||     ||       || || ||||      |||||          ||||||||||               ||||    ||       ||       ||||||||| ||  ||         
                ||| ||  || ||     ||      ||| |||||    ||||              ||||||   ||             ||||||    ||       ||   ||||||||      ||  ||         
               |||  || ||| ||     ||     |||  ||| ||||||||||              ||  || ||            ||||| ||    ||       ||   |||| || |||  |||  ||         
              ||    || ||  |||   |||    |||   ||  |||    |||              |   || ||||           |||  ||    |||     |||       |||  ||| ||   ||         
                   |||||   |||||||||          ||   ||   |||              ||   ||  ||||               ||     ||||||||||       ||   ||||||   ||         
                 ||||||     ||||||||          ||   ||||||||             |||   ||   |||             ||||     ||||||||||      ||     ||||    ||         
                  |||        ||||||          |||   ||||||||             ||| ||||    |||            ||||       ||||||       ||       ||     ||         
                   ||                        |||    |                   ||  ||||     |              |||                    |               ||         
                                              |                              |||                     |                                     ||         
                                                                              |                                                            |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         
`))
export { apps };